{"loss_weights": null, "optimizer": {"epsilon": 1e-08, "name": "RMSprop", "rho": 0.8999999761581421, "lr": 9.999999747378752e-05}, "class_name": "Model", "config": {"name": "model_1", "input_layers": [["input_1", 0, 0]], "layers": [{"config": {"input_dtype": "int32", "batch_input_shape": [null, 20], "name": "input_1"}, "class_name": "InputLayer", "inbound_nodes": [], "name": "input_1"}, {"config": {"init": "uniform", "activity_regularizer": null, "name": "embedding_1", "output_dim": 256, "dropout": 0.0, "W_regularizer": null, "input_length": 20, "batch_input_shape": [null, 20], "input_dim": 4900, "mask_zero": true, "input_dtype": "int32", "trainable": true, "W_constraint": null}, "class_name": "Embedding", "inbound_nodes": [[["input_1", 0, 0]]], "name": "embedding_1"}, {"config": {"init": "glorot_uniform", "activation": "tanh", "inner_init": "orthogonal", "inner_activation": "hard_sigmoid", "name": "lstm_1", "output_dim": 128, "stateful": false, "return_sequences": true, "input_length": null, "W_regularizer": null, "dropout_U": 0.0, "input_dim": 256, "dropout_W": 0.0, "go_backwards": false, "consume_less": "cpu", "U_regularizer": null, "forget_bias_init": "one", "trainable": true, "b_regularizer": null, "unroll": false}, "class_name": "LSTM", "inbound_nodes": [[["embedding_1", 0, 0]]], "name": "lstm_1"}, {"config": {"init": "glorot_uniform", "activation": "tanh", "inner_init": "orthogonal", "inner_activation": "hard_sigmoid", "name": "lstm_3", "output_dim": 128, "stateful": false, "return_sequences": true, "input_length": null, "W_regularizer": null, "dropout_U": 0.0, "input_dim": 256, "dropout_W": 0.0, "go_backwards": true, "consume_less": "cpu", "U_regularizer": null, "forget_bias_init": "one", "trainable": true, "b_regularizer": null, "unroll": false}, "class_name": "LSTM", "inbound_nodes": [[["embedding_1", 0, 0]]], "name": "lstm_3"}, {"config": {"init": "glorot_uniform", "activation": "tanh", "inner_init": "orthogonal", "inner_activation": "hard_sigmoid", "name": "lstm_2", "output_dim": 128, "stateful": false, "return_sequences": false, "input_length": null, "W_regularizer": null, "dropout_U": 0.0, "input_dim": 128, "dropout_W": 0.0, "go_backwards": false, "consume_less": "cpu", "U_regularizer": null, "forget_bias_init": "one", "trainable": true, "b_regularizer": null, "unroll": false}, "class_name": "LSTM", "inbound_nodes": [[["lstm_1", 0, 0]]], "name": "lstm_2"}, {"config": {"init": "glorot_uniform", "activation": "tanh", "inner_init": "orthogonal", "inner_activation": "hard_sigmoid", "name": "lstm_4", "output_dim": 128, "stateful": false, "return_sequences": false, "input_length": null, "W_regularizer": null, "dropout_U": 0.0, "input_dim": 128, "dropout_W": 0.0, "go_backwards": false, "consume_less": "cpu", "U_regularizer": null, "forget_bias_init": "one", "trainable": true, "b_regularizer": null, "unroll": false}, "class_name": "LSTM", "inbound_nodes": [[["lstm_3", 0, 0]]], "name": "lstm_4"}, {"config": {"mode": "concat", "concat_axis": -1, "name": "merge_1", "mode_type": "raw", "output_shape": null, "output_shape_type": "raw", "dot_axes": [-1, -1]}, "class_name": "Merge", "inbound_nodes": [[["lstm_2", 0, 0], ["lstm_4", 0, 0]]], "name": "merge_1"}, {"config": {"name": "dropout_1", "p": 0.5, "trainable": true}, "class_name": "Dropout", "inbound_nodes": [[["merge_1", 0, 0]]], "name": "dropout_1"}, {"config": {"init": "glorot_uniform", "activity_regularizer": null, "activation": "softmax", "b_regularizer": null, "name": "dense_1", "output_dim": 15, "W_regularizer": null, "input_dim": null, "b_constraint": null, "bias": true, "trainable": true, "W_constraint": null}, "class_name": "Dense", "inbound_nodes": [[["dropout_1", 0, 0]]], "name": "dense_1"}], "output_layers": [["dense_1", 0, 0]]}, "loss": "categorical_crossentropy", "sample_weight_mode": null, "keras_version": "1.0.5"}