{"class_name": "Model", "loss_weights": null, "sample_weight_mode": null, "config": {"name": "model_1", "layers": [{"class_name": "InputLayer", "config": {"input_dtype": "int32", "batch_input_shape": [null, 20], "name": "input_1"}, "name": "input_1", "inbound_nodes": []}, {"class_name": "Embedding", "config": {"output_dim": 128, "input_dim": 4900, "dropout": 0.0, "W_constraint": null, "input_dtype": "int32", "activity_regularizer": null, "batch_input_shape": [null, 20], "trainable": true, "mask_zero": true, "init": "uniform", "input_length": 20, "W_regularizer": null, "name": "embedding_1"}, "name": "embedding_1", "inbound_nodes": [[["input_1", 0, 0]]]}, {"class_name": "LSTM", "config": {"output_dim": 64, "consume_less": "gpu", "unroll": false, "input_dim": 128, "dropout_W": 0.0, "b_regularizer": null, "U_regularizer": null, "dropout_U": 0.0, "stateful": false, "return_sequences": true, "inner_activation": "hard_sigmoid", "trainable": true, "activation": "tanh", "inner_init": "orthogonal", "forget_bias_init": "one", "go_backwards": false, "init": "glorot_uniform", "W_regularizer": null, "name": "lstm_1", "input_length": null}, "name": "lstm_1", "inbound_nodes": [[["embedding_1", 0, 0]]]}, {"class_name": "LSTM", "config": {"output_dim": 64, "consume_less": "gpu", "unroll": false, "input_dim": 128, "dropout_W": 0.0, "b_regularizer": null, "U_regularizer": null, "dropout_U": 0.0, "stateful": false, "return_sequences": true, "inner_activation": "hard_sigmoid", "trainable": true, "activation": "tanh", "inner_init": "orthogonal", "forget_bias_init": "one", "go_backwards": true, "init": "glorot_uniform", "W_regularizer": null, "name": "lstm_3", "input_length": null}, "name": "lstm_3", "inbound_nodes": [[["embedding_1", 0, 0]]]}, {"class_name": "LSTM", "config": {"output_dim": 32, "consume_less": "cpu", "unroll": false, "input_dim": 64, "dropout_W": 0.0, "b_regularizer": null, "U_regularizer": null, "dropout_U": 0.0, "stateful": false, "return_sequences": false, "inner_activation": "hard_sigmoid", "trainable": true, "activation": "tanh", "inner_init": "orthogonal", "forget_bias_init": "one", "go_backwards": false, "init": "glorot_uniform", "W_regularizer": null, "name": "lstm_2", "input_length": null}, "name": "lstm_2", "inbound_nodes": [[["lstm_1", 0, 0]]]}, {"class_name": "LSTM", "config": {"output_dim": 32, "consume_less": "cpu", "unroll": false, "input_dim": 64, "dropout_W": 0.0, "b_regularizer": null, "U_regularizer": null, "dropout_U": 0.0, "stateful": false, "return_sequences": false, "inner_activation": "hard_sigmoid", "trainable": true, "activation": "tanh", "inner_init": "orthogonal", "forget_bias_init": "one", "go_backwards": false, "init": "glorot_uniform", "W_regularizer": null, "name": "lstm_4", "input_length": null}, "name": "lstm_4", "inbound_nodes": [[["lstm_3", 0, 0]]]}, {"class_name": "Merge", "config": {"concat_axis": -1, "mode": "concat", "output_shape_type": "raw", "dot_axes": [-1, -1], "output_shape": null, "name": "merge_1", "mode_type": "raw"}, "name": "merge_1", "inbound_nodes": [[["lstm_2", 0, 0], ["lstm_4", 0, 0]]]}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_1"}, "name": "dropout_1", "inbound_nodes": [[["merge_1", 0, 0]]]}, {"class_name": "Dense", "config": {"output_dim": 15, "W_constraint": null, "b_constraint": null, "bias": true, "b_regularizer": null, "input_dim": null, "activity_regularizer": null, "activation": "relu", "trainable": true, "init": "glorot_uniform", "W_regularizer": null, "name": "dense_1"}, "name": "dense_1", "inbound_nodes": [[["dropout_1", 0, 0]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["dense_1", 0, 0]]}, "optimizer": {"epsilon": 1e-08, "rho": 0.8999999761581421, "name": "RMSprop", "lr": 9.999999747378752e-05}, "loss": "categorical_crossentropy", "keras_version": "1.0.5"}