{"config": {"input_layers": [["input_1", 0, 0]], "name": "model_1", "layers": [{"config": {"input_dtype": "int32", "batch_input_shape": [null, 20], "name": "input_1"}, "name": "input_1", "class_name": "InputLayer", "inbound_nodes": []}, {"config": {"W_regularizer": null, "batch_input_shape": [null, 20], "output_dim": 256, "name": "embedding_1", "input_length": 20, "W_constraint": null, "input_dtype": "int32", "input_dim": 4900, "dropout": 0.0, "mask_zero": true, "trainable": true, "init": "uniform", "activity_regularizer": null}, "name": "embedding_1", "class_name": "Embedding", "inbound_nodes": [[["input_1", 0, 0]]]}, {"config": {"activation": "tanh", "stateful": false, "consume_less": "gpu", "forget_bias_init": "one", "output_dim": 64, "input_length": null, "trainable": true, "unroll": false, "inner_init": "orthogonal", "name": "lstm_1", "inner_activation": "hard_sigmoid", "input_dim": 256, "dropout_U": 0.0, "return_sequences": true, "W_regularizer": null, "go_backwards": false, "U_regularizer": null, "dropout_W": 0.0, "init": "glorot_uniform", "b_regularizer": null}, "name": "lstm_1", "class_name": "LSTM", "inbound_nodes": [[["embedding_1", 0, 0]]]}, {"config": {"activation": "tanh", "stateful": false, "consume_less": "gpu", "forget_bias_init": "one", "output_dim": 64, "input_length": null, "trainable": true, "unroll": false, "inner_init": "orthogonal", "name": "lstm_3", "inner_activation": "hard_sigmoid", "input_dim": 256, "dropout_U": 0.0, "return_sequences": true, "W_regularizer": null, "go_backwards": true, "U_regularizer": null, "dropout_W": 0.0, "init": "glorot_uniform", "b_regularizer": null}, "name": "lstm_3", "class_name": "LSTM", "inbound_nodes": [[["embedding_1", 0, 0]]]}, {"config": {"activation": "tanh", "stateful": false, "consume_less": "gpu", "forget_bias_init": "one", "output_dim": 64, "input_length": null, "trainable": true, "unroll": false, "inner_init": "orthogonal", "name": "lstm_2", "inner_activation": "hard_sigmoid", "input_dim": 64, "dropout_U": 0.0, "return_sequences": false, "W_regularizer": null, "go_backwards": false, "U_regularizer": null, "dropout_W": 0.0, "init": "glorot_uniform", "b_regularizer": null}, "name": "lstm_2", "class_name": "LSTM", "inbound_nodes": [[["lstm_1", 0, 0]]]}, {"config": {"activation": "tanh", "stateful": false, "consume_less": "gpu", "forget_bias_init": "one", "output_dim": 64, "input_length": null, "trainable": true, "unroll": false, "inner_init": "orthogonal", "name": "lstm_4", "inner_activation": "hard_sigmoid", "input_dim": 64, "dropout_U": 0.0, "return_sequences": false, "W_regularizer": null, "go_backwards": false, "U_regularizer": null, "dropout_W": 0.0, "init": "glorot_uniform", "b_regularizer": null}, "name": "lstm_4", "class_name": "LSTM", "inbound_nodes": [[["lstm_3", 0, 0]]]}, {"config": {"name": "merge_1", "mode_type": "raw", "output_shape_type": "raw", "mode": "concat", "dot_axes": [-1, -1], "concat_axis": -1, "output_shape": null}, "name": "merge_1", "class_name": "Merge", "inbound_nodes": [[["lstm_2", 0, 0], ["lstm_4", 0, 0]]]}, {"config": {"name": "dropout_1", "trainable": true, "p": 0.5}, "name": "dropout_1", "class_name": "Dropout", "inbound_nodes": [[["merge_1", 0, 0]]]}, {"config": {"activation": "softmax", "W_regularizer": null, "output_dim": 15, "trainable": true, "b_constraint": null, "W_constraint": null, "name": "dense_1", "input_dim": null, "bias": true, "b_regularizer": null, "init": "glorot_uniform", "activity_regularizer": null}, "name": "dense_1", "class_name": "Dense", "inbound_nodes": [[["dropout_1", 0, 0]]]}], "output_layers": [["dense_1", 0, 0]]}, "loss_weights": null, "optimizer": {"epsilon": 1e-08, "name": "RMSprop", "rho": 0.8999999761581421, "lr": 9.999999747378752e-05}, "class_name": "Model", "loss": "categorical_crossentropy", "sample_weight_mode": null, "keras_version": "1.0.5"}