{"loss": "categorical_crossentropy", "keras_version": "1.0.5", "sample_weight_mode": null, "class_name": "Model", "loss_weights": null, "config": {"name": "model_1", "layers": [{"name": "input_1", "inbound_nodes": [], "config": {"name": "input_1", "batch_input_shape": [null, 20], "input_dtype": "int32"}, "class_name": "InputLayer"}, {"name": "embedding_1", "inbound_nodes": [[["input_1", 0, 0]]], "config": {"W_constraint": null, "name": "embedding_1", "trainable": true, "init": "uniform", "output_dim": 256, "W_regularizer": null, "dropout": 0.0, "mask_zero": true, "input_length": 20, "batch_input_shape": [null, 20], "input_dtype": "int32", "input_dim": 4900, "activity_regularizer": null}, "class_name": "Embedding"}, {"name": "lstm_1", "inbound_nodes": [[["embedding_1", 0, 0]]], "config": {"inner_init": "orthogonal", "name": "lstm_1", "go_backwards": false, "inner_activation": "hard_sigmoid", "trainable": true, "forget_bias_init": "one", "init": "glorot_uniform", "input_length": null, "b_regularizer": null, "return_sequences": true, "dropout_U": 0.0, "W_regularizer": null, "dropout_W": 0.0, "output_dim": 128, "unroll": false, "stateful": false, "input_dim": 256, "U_regularizer": null, "consume_less": "gpu", "activation": "tanh"}, "class_name": "LSTM"}, {"name": "lstm_3", "inbound_nodes": [[["embedding_1", 0, 0]]], "config": {"inner_init": "orthogonal", "name": "lstm_3", "go_backwards": true, "inner_activation": "hard_sigmoid", "trainable": true, "forget_bias_init": "one", "init": "glorot_uniform", "input_length": null, "b_regularizer": null, "return_sequences": true, "dropout_U": 0.0, "W_regularizer": null, "dropout_W": 0.0, "output_dim": 128, "unroll": false, "stateful": false, "input_dim": 256, "U_regularizer": null, "consume_less": "gpu", "activation": "tanh"}, "class_name": "LSTM"}, {"name": "lstm_2", "inbound_nodes": [[["lstm_1", 0, 0]]], "config": {"inner_init": "orthogonal", "name": "lstm_2", "go_backwards": false, "inner_activation": "hard_sigmoid", "trainable": true, "forget_bias_init": "one", "init": "glorot_uniform", "input_length": null, "b_regularizer": null, "return_sequences": false, "dropout_U": 0.0, "W_regularizer": null, "dropout_W": 0.0, "output_dim": 64, "unroll": false, "stateful": false, "input_dim": 128, "U_regularizer": null, "consume_less": "gpu", "activation": "tanh"}, "class_name": "LSTM"}, {"name": "lstm_4", "inbound_nodes": [[["lstm_3", 0, 0]]], "config": {"inner_init": "orthogonal", "name": "lstm_4", "go_backwards": false, "inner_activation": "hard_sigmoid", "trainable": true, "forget_bias_init": "one", "init": "glorot_uniform", "input_length": null, "b_regularizer": null, "return_sequences": false, "dropout_U": 0.0, "W_regularizer": null, "dropout_W": 0.0, "output_dim": 64, "unroll": false, "stateful": false, "input_dim": 128, "U_regularizer": null, "consume_less": "gpu", "activation": "tanh"}, "class_name": "LSTM"}, {"name": "merge_1", "inbound_nodes": [[["lstm_2", 0, 0], ["lstm_4", 0, 0]]], "config": {"name": "merge_1", "dot_axes": [-1, -1], "output_shape": null, "mode_type": "raw", "mode": "concat", "concat_axis": -1, "output_shape_type": "raw"}, "class_name": "Merge"}, {"name": "dropout_1", "inbound_nodes": [[["merge_1", 0, 0]]], "config": {"name": "dropout_1", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"name": "dense_1", "inbound_nodes": [[["dropout_1", 0, 0]]], "config": {"W_constraint": null, "trainable": true, "init": "glorot_uniform", "output_dim": 16, "b_regularizer": null, "W_regularizer": null, "name": "dense_1", "bias": true, "activity_regularizer": null, "input_dim": null, "b_constraint": null, "activation": "softmax"}, "class_name": "Dense"}], "input_layers": [["input_1", 0, 0]], "output_layers": [["dense_1", 0, 0]]}, "optimizer": {"name": "RMSprop", "rho": 0.8999999761581421, "epsilon": 1e-08, "lr": 9.999999747378752e-05}}