{"loss": "categorical_crossentropy", "class_name": "Model", "optimizer": {"name": "RMSprop", "epsilon": 1e-08, "rho": 0.8999999761581421, "lr": 9.999999747378752e-05}, "keras_version": "1.0.5", "sample_weight_mode": null, "loss_weights": null, "config": {"layers": [{"name": "input_1", "inbound_nodes": [], "config": {"name": "input_1", "input_dtype": "int32", "batch_input_shape": [null, 20]}, "class_name": "InputLayer"}, {"name": "embedding_1", "inbound_nodes": [[["input_1", 0, 0]]], "config": {"input_length": 20, "dropout": 0.0, "W_constraint": null, "input_dtype": "int32", "batch_input_shape": [null, 20], "output_dim": 128, "name": "embedding_1", "activity_regularizer": null, "trainable": true, "input_dim": 4900, "mask_zero": true, "W_regularizer": null, "init": "uniform"}, "class_name": "Embedding"}, {"name": "lstm_1", "inbound_nodes": [[["embedding_1", 0, 0]]], "config": {"U_regularizer": null, "go_backwards": false, "stateful": false, "dropout_W": 0.0, "W_regularizer": null, "inner_init": "orthogonal", "unroll": false, "dropout_U": 0.0, "input_length": null, "b_regularizer": null, "activation": "tanh", "consume_less": "gpu", "name": "lstm_1", "inner_activation": "hard_sigmoid", "init": "glorot_uniform", "forget_bias_init": "one", "input_dim": 128, "return_sequences": true, "output_dim": 64, "trainable": true}, "class_name": "LSTM"}, {"name": "lstm_3", "inbound_nodes": [[["embedding_1", 0, 0]]], "config": {"U_regularizer": null, "go_backwards": true, "stateful": false, "dropout_W": 0.0, "W_regularizer": null, "inner_init": "orthogonal", "unroll": false, "dropout_U": 0.0, "input_length": null, "b_regularizer": null, "activation": "tanh", "consume_less": "gpu", "name": "lstm_3", "inner_activation": "hard_sigmoid", "init": "glorot_uniform", "forget_bias_init": "one", "input_dim": 128, "return_sequences": true, "output_dim": 64, "trainable": true}, "class_name": "LSTM"}, {"name": "lstm_2", "inbound_nodes": [[["lstm_1", 0, 0]]], "config": {"U_regularizer": null, "go_backwards": false, "stateful": false, "dropout_W": 0.0, "W_regularizer": null, "inner_init": "orthogonal", "unroll": false, "dropout_U": 0.0, "input_length": null, "b_regularizer": null, "activation": "tanh", "consume_less": "gpu", "name": "lstm_2", "inner_activation": "hard_sigmoid", "init": "glorot_uniform", "forget_bias_init": "one", "input_dim": 64, "return_sequences": false, "output_dim": 64, "trainable": true}, "class_name": "LSTM"}, {"name": "lstm_4", "inbound_nodes": [[["lstm_3", 0, 0]]], "config": {"U_regularizer": null, "go_backwards": false, "stateful": false, "dropout_W": 0.0, "W_regularizer": null, "inner_init": "orthogonal", "unroll": false, "dropout_U": 0.0, "input_length": null, "b_regularizer": null, "activation": "tanh", "consume_less": "gpu", "name": "lstm_4", "inner_activation": "hard_sigmoid", "init": "glorot_uniform", "forget_bias_init": "one", "input_dim": 64, "return_sequences": false, "output_dim": 64, "trainable": true}, "class_name": "LSTM"}, {"name": "merge_1", "inbound_nodes": [[["lstm_2", 0, 0], ["lstm_4", 0, 0]]], "config": {"name": "merge_1", "output_shape": null, "concat_axis": -1, "output_shape_type": "raw", "mode": "concat", "dot_axes": [-1, -1], "mode_type": "raw"}, "class_name": "Merge"}, {"name": "dropout_1", "inbound_nodes": [[["merge_1", 0, 0]]], "config": {"name": "dropout_1", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"name": "dense_1", "inbound_nodes": [[["dropout_1", 0, 0]]], "config": {"b_constraint": null, "bias": true, "W_constraint": null, "activation": "softmax", "b_regularizer": null, "output_dim": 15, "name": "dense_1", "trainable": true, "input_dim": null, "W_regularizer": null, "activity_regularizer": null, "init": "glorot_uniform"}, "class_name": "Dense"}], "name": "model_1", "output_layers": [["dense_1", 0, 0]], "input_layers": [["input_1", 0, 0]]}}