{"config": {"input_layers": [["input_1", 0, 0]], "name": "model_1", "layers": [{"config": {"name": "input_1", "batch_input_shape": [null, 20], "input_dtype": "int32"}, "class_name": "InputLayer", "name": "input_1", "inbound_nodes": []}, {"config": {"input_length": 20, "W_constraint": null, "batch_input_shape": [null, 20], "W_regularizer": null, "dropout": 0.0, "mask_zero": true, "activity_regularizer": null, "output_dim": 256, "name": "embedding_1", "init": "uniform", "input_dim": 4900, "trainable": true, "input_dtype": "int32"}, "class_name": "Embedding", "name": "embedding_1", "inbound_nodes": [[["input_1", 0, 0]]]}, {"config": {"unroll": false, "activation": "tanh", "stateful": false, "input_length": null, "dropout_U": 0.0, "W_regularizer": null, "U_regularizer": null, "go_backwards": false, "b_regularizer": null, "forget_bias_init": "one", "return_sequences": true, "inner_init": "orthogonal", "dropout_W": 0.0, "output_dim": 128, "consume_less": "cpu", "name": "lstm_1", "init": "glorot_uniform", "input_dim": 256, "trainable": true, "inner_activation": "hard_sigmoid"}, "class_name": "LSTM", "name": "lstm_1", "inbound_nodes": [[["embedding_1", 0, 0]]]}, {"config": {"unroll": false, "activation": "tanh", "stateful": false, "input_length": null, "dropout_U": 0.0, "W_regularizer": null, "U_regularizer": null, "go_backwards": true, "b_regularizer": null, "forget_bias_init": "one", "return_sequences": true, "inner_init": "orthogonal", "dropout_W": 0.0, "output_dim": 128, "consume_less": "cpu", "name": "lstm_3", "init": "glorot_uniform", "input_dim": 256, "trainable": true, "inner_activation": "hard_sigmoid"}, "class_name": "LSTM", "name": "lstm_3", "inbound_nodes": [[["embedding_1", 0, 0]]]}, {"config": {"unroll": false, "activation": "tanh", "stateful": false, "input_length": null, "dropout_U": 0.0, "W_regularizer": null, "U_regularizer": null, "go_backwards": false, "b_regularizer": null, "forget_bias_init": "one", "return_sequences": false, "inner_init": "orthogonal", "dropout_W": 0.0, "output_dim": 128, "consume_less": "cpu", "name": "lstm_2", "init": "glorot_uniform", "input_dim": 128, "trainable": true, "inner_activation": "hard_sigmoid"}, "class_name": "LSTM", "name": "lstm_2", "inbound_nodes": [[["lstm_1", 0, 0]]]}, {"config": {"unroll": false, "activation": "tanh", "stateful": false, "input_length": null, "dropout_U": 0.0, "W_regularizer": null, "U_regularizer": null, "go_backwards": false, "b_regularizer": null, "forget_bias_init": "one", "return_sequences": false, "inner_init": "orthogonal", "dropout_W": 0.0, "output_dim": 128, "consume_less": "cpu", "name": "lstm_4", "init": "glorot_uniform", "input_dim": 128, "trainable": true, "inner_activation": "hard_sigmoid"}, "class_name": "LSTM", "name": "lstm_4", "inbound_nodes": [[["lstm_3", 0, 0]]]}, {"config": {"mode": "concat", "mode_type": "raw", "name": "merge_1", "dot_axes": [-1, -1], "concat_axis": -1, "output_shape_type": "raw", "output_shape": null}, "class_name": "Merge", "name": "merge_1", "inbound_nodes": [[["lstm_2", 0, 0], ["lstm_4", 0, 0]]]}, {"config": {"name": "dropout_1", "trainable": true, "p": 0.5}, "class_name": "Dropout", "name": "dropout_1", "inbound_nodes": [[["merge_1", 0, 0]]]}, {"config": {"activation": "softmax", "W_constraint": null, "W_regularizer": null, "b_regularizer": null, "bias": true, "activity_regularizer": null, "output_dim": 15, "name": "dense_1", "init": "glorot_uniform", "input_dim": null, "b_constraint": null, "trainable": true}, "class_name": "Dense", "name": "dense_1", "inbound_nodes": [[["dropout_1", 0, 0]]]}], "output_layers": [["dense_1", 0, 0]]}, "loss_weights": null, "keras_version": "1.0.5", "class_name": "Model", "sample_weight_mode": null, "loss": "categorical_crossentropy", "optimizer": {"lr": 9.999999747378752e-06, "epsilon": 1e-08, "name": "RMSprop", "rho": 0.8999999761581421}}