{"sample_weight_mode": null, "config": {"output_layers": [["dense_1", 0, 0]], "name": "model_1", "layers": [{"class_name": "InputLayer", "name": "input_1", "config": {"name": "input_1", "batch_input_shape": [null, 20], "input_dtype": "int32"}, "inbound_nodes": []}, {"class_name": "Embedding", "name": "embedding_1", "config": {"mask_zero": false, "name": "embedding_1", "dropout": 0.0, "activity_regularizer": null, "output_dim": 256, "W_constraint": null, "init": "uniform", "W_regularizer": null, "input_length": 20, "trainable": true, "input_dtype": "int32", "input_dim": 4900, "batch_input_shape": [null, 20]}, "inbound_nodes": [[["input_1", 0, 0]]]}, {"class_name": "LSTM", "name": "lstm_1", "config": {"consume_less": "cpu", "name": "lstm_1", "stateful": false, "dropout_W": 0.0, "unroll": false, "output_dim": 128, "dropout_U": 0.0, "return_sequences": true, "init": "glorot_uniform", "activation": "tanh", "input_length": null, "U_regularizer": null, "input_dim": 256, "forget_bias_init": "one", "trainable": true, "W_regularizer": null, "go_backwards": false, "b_regularizer": null, "inner_activation": "hard_sigmoid", "inner_init": "orthogonal"}, "inbound_nodes": [[["embedding_1", 0, 0]]]}, {"class_name": "LSTM", "name": "lstm_3", "config": {"consume_less": "cpu", "name": "lstm_3", "stateful": false, "dropout_W": 0.0, "unroll": false, "output_dim": 128, "dropout_U": 0.0, "return_sequences": true, "init": "glorot_uniform", "activation": "tanh", "input_length": null, "U_regularizer": null, "input_dim": 256, "forget_bias_init": "one", "trainable": true, "W_regularizer": null, "go_backwards": true, "b_regularizer": null, "inner_activation": "hard_sigmoid", "inner_init": "orthogonal"}, "inbound_nodes": [[["embedding_1", 0, 0]]]}, {"class_name": "LSTM", "name": "lstm_2", "config": {"consume_less": "cpu", "name": "lstm_2", "stateful": false, "dropout_W": 0.0, "unroll": false, "output_dim": 128, "dropout_U": 0.0, "return_sequences": false, "init": "glorot_uniform", "activation": "tanh", "input_length": null, "U_regularizer": null, "input_dim": 128, "forget_bias_init": "one", "trainable": true, "W_regularizer": null, "go_backwards": false, "b_regularizer": null, "inner_activation": "hard_sigmoid", "inner_init": "orthogonal"}, "inbound_nodes": [[["lstm_1", 0, 0]]]}, {"class_name": "LSTM", "name": "lstm_4", "config": {"consume_less": "cpu", "name": "lstm_4", "stateful": false, "dropout_W": 0.0, "unroll": false, "output_dim": 128, "dropout_U": 0.0, "return_sequences": false, "init": "glorot_uniform", "activation": "tanh", "input_length": null, "U_regularizer": null, "input_dim": 128, "forget_bias_init": "one", "trainable": true, "W_regularizer": null, "go_backwards": false, "b_regularizer": null, "inner_activation": "hard_sigmoid", "inner_init": "orthogonal"}, "inbound_nodes": [[["lstm_3", 0, 0]]]}, {"class_name": "Merge", "name": "merge_1", "config": {"name": "merge_1", "output_shape_type": "raw", "mode": "concat", "output_shape": null, "mode_type": "raw", "dot_axes": [-1, -1], "concat_axis": -1}, "inbound_nodes": [[["lstm_2", 0, 0], ["lstm_4", 0, 0]]]}, {"class_name": "Dropout", "name": "dropout_1", "config": {"name": "dropout_1", "trainable": true, "p": 0.5}, "inbound_nodes": [[["merge_1", 0, 0]]]}, {"class_name": "Dense", "name": "dense_1", "config": {"name": "dense_1", "activity_regularizer": null, "b_regularizer": null, "W_constraint": null, "init": "glorot_uniform", "output_dim": 15, "activation": "softmax", "bias": true, "input_dim": null, "W_regularizer": null, "trainable": true, "b_constraint": null}, "inbound_nodes": [[["dropout_1", 0, 0]]]}], "input_layers": [["input_1", 0, 0]]}, "loss_weights": null, "loss": "categorical_crossentropy", "class_name": "Model", "keras_version": "1.0.5", "optimizer": {"lr": 4.999999873689376e-05, "name": "RMSprop", "epsilon": 1e-08, "rho": 0.8999999761581421}}