// ⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪
// ⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪
// ⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪💙⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪
// ⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪💙💙⚪💙⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪
// ⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪💙💙💙💙💙⚪⚪⚪❤🎀⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪
// ⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪💙💙💙💙💙💙💙💙🌚❤🎀🎀🎀🎀⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪
// ⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪💙💙💙💙💙💙💙💙💙💙💙💙💙🎀🎀🎀👕🎀💙⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪
// ⚪⚪⚪⚪⚪⚪⚪⚪⚪💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙🎀🎀💙💙👕💙💙💙⚪⚪⚪⚪⚪⚪⚪⚪
// ⚪⚪⚪⚪⚪⚪⚪💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙👕💙💙💙💙💙💙💙💙💙⚪⚪⚪⚪⚪⚪
// ⚪⚪⚪⚪⚪⚪💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙⚪⚪⚪⚪⚪
// ⚪⚪⚪⚪⚪💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙⚪⚪⚪⚪
// ⚪⚪⚪⚪💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙⚪⚪⚪
// ⚪⚪⚪💙💙💙💙💙💙💙💙💙💭💭💙💭💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙💙⚪⚪
// ⚪⚪⚪💙💙💙💙💙💙💙⚪🌚⚪⚪⚪⚪⚪💭💭💙💙💙💙💙💙⚪⚪💭💭💭⚪⚪💙💙💙💙💙💙⚪⚪
// ⚪⚪💙💙💙💙💙💙💙⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪💙💙💙💙💭⚪⚪⚪⚪⚪⚪⚪💭💙💙💙💙💙💙⚪
// ⚪⚪💙💙💙💙💙💙🌚⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪💭💙💙💙⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪💙💙💙💙💙⚪
// ⚪💙💙💙💙💙💙💭⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪💙🌚⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪💭💙💙💙💙💙
// ⚪💙💙💙💙💙⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪💙💙💙💙
// ⚪💙💙💙💙💙⚪⚪⚪⚪⚫⚫⚫⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚫⚫⚫⚪⚪⚪⚪⚪💙💙💙💙
// ⚪💙💙💙💙💙⚪⚪⚪🌚⚫⚫⚫⚪⚪⚪⚪⚪⚪⚪🌚🌚⚪⚪⚪⚪⚪⚫⚫⚫⚫⚪⚪⚪⚪⚪💙💙💙💙
// ⚪💙💙💙💙💙⚪⚪⚪🌕⚫⚫⚫⚪⚪⚪⚪🍊🍊🍊🍊🍊🍊🍊⚪⚪⚪🌚⚫⚫⚫⚪⚪⚪⚪⚪💙💙💙💙
// ⚪💙💙💙💙💙⚪⚪⚪⚪🌕⚪⚪⚪⚪⚪🍊🍊🍊🍊🍊🍊🍊🍊🍊⚪⚪⚪🌕⚪⚪⚪⚪⚪⚪⚪💙💙💙💙
// ⚪💙💙💙💙💙🐙⚪⚪⚪⚪⚪⚪⚪⚪⚪💰🍊🍊🍊🍊🍊🍊🍊⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪💙💙💙💙
// ⚪⚪💙💙💙💙💙⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪💛⚪💛⚪🍊⚪💰⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪💙💙💙💙
// ⚪⚪💙💙💙💙💙⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪💙💙💙💙
// ⚪⚪⚪💙💙💙💙🐙⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪💙💙💙⚪
// ⚪⚪⚪💙💙💙💙💙⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪💙💙💙💙⚪
// ⚪⚪⚪⚪💙💙💙💙⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪💙💙💙⚪⚪
// ⚪⚪⚪⚪⚪💙💙💙💙⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪🐙💙💙⚪⚪⚪
// ⚪⚪⚪⚪⚪⚪⚪💙💙💙⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪💙⚪⚪⚪⚪⚪
// ⚪⚪⚪⚪⚪⚪⚪⚪🌚💙⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪
// ⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪
// ⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪
// ⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪
// ⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪
// ⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪
// ⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪⚪
//Cinna 0.7 (Paprika)

var http = require('http');
var request = require('request');
var async = require('async');
var bodyParser = require('body-parser');
var busboy = require('connect-busboy'); // for multi-part data from sendgrid
var email = require('./components/email');

//set env vars
var config = require('config');

process.on('uncaughtException', function (err) {
  console.error('uncaught exception', new Date())
  console.error(err.stack);
});

//load kip modules
var ioKip = require("./components/io.js");

// website 🌏
var express = require('express');
var app = express();
var server = require('http').createServer(app);
app.use(express.static(__dirname + '/static'))
app.get('/healthcheck', function (req, res) {
  res.send('💬 🌏')
})

//parse incoming body
app.use(bodyParser.json());
app.use(bodyParser.urlencoded({ extended: true }));


server.listen(8000, function(e) {
  if (e) { console.error(e) }
  console.log('chat app listening on port 8000 🌏 💬')
})

//globals
var messageHistory = {}; //fake database, stores all users and their chat histories

//load incoming chat clients
ioKip.initSlackUsers(app.get('env'));
ioKip.loadSocketIO(server);

//incoming new slack user
app.get('/newslack', function(req, res) {
    ioKip.newSlack();
});

//incoming slack action
app.post('/slackaction', function(req, res) {
    // ioKip.newSlack();
    console.log('incoming Slack action BODY: ',req.body);

    if (req.body && req.body.payload){
      var parsedIn = JSON.parse(req.body.payload);

      /// FOR INITIAL SEARCHES

      //sends back original chat
      if (parsedIn.response_url && parsedIn.original_message){
        var stringOrig = JSON.stringify(parsedIn.original_message);
        request.post(
            parsedIn.response_url,
            { payload: stringOrig },
            function (err, res, body) {
              console.error('post err ',err);
            }
        );
      }else {
        console.error('slack buttons broke, need a response_url');
        return;
      }
    }else {
      console.log('nah');
      res.sendStatus(200);
    }

    // //SEND REQ.BODY: { payload: }
    // ioKip.incomingMsgAction(req.body,'slack');
});


// incoming email from sendgrid
// In development we're currently using peter's sendgrid api key etc
app.post('/sendgrid', busboy({immediate: true}), function(req, res) {
    req.body = {};
    req.busboy.on('field', (k, v) => {
      req.body[k] = v;
    })

    req.busboy.on('finish', () => {
      email.process(req.body);
      res.sendStatus(200);
    })
})

//incoming kik message
app.post('/kikincoming', function(req, res) {
    console.log('incoming Kik BODY: ',req.body);
    res.sendStatus(200);
    ioKip.incomingMsgAction(req.body,'kik');
    res.sendStatus(200);
});
